src/Catalogs/ПолитикиМФП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПолитикиМФП</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешенаЗакупкаУВнешнихПоставщиков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешенаПродажаВнешнимКлиентам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешенаПродажаСобственнымОрганизациям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобственныеОрганизацииРазрешенаПродажаСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СобственныеОрганизацииРазрешенаПродажа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентНаценки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ПолитикиМФП/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если Не ПометкаУдаления И Не Справочники.ПолитикиМФП.ПолитикаУникальна(Ссылка, Владелец, ПериодДействия) Тогда
		Отказ = Истина;
		Сообщить("Уже есть политика МФП для этой организации от "+Формат(ПериодДействия,"ДФ=dd.MM.yyyy"));
	КонецЕсли;
	
	Если Не ПометкаУдаления Тогда
		ПередЗаписьюПроверитьЗаполненностьРеквизитов(Отказ);
	КонецЕсли;
	
	КолРегистраций = СобственныеОрганизацииРазрешенаПродажа.Количество();
	
	СобственныеОрганизацииРазрешенаПродажаСтрокой = ?(КолРегистраций = 0, "", "Разрешена продажа "+СобственныеОрганизацииРазрешенаПродажа.Количество()+" организациям");
	
	ПроверитьОрганизацииПродажи(Отказ);
	
КонецПроцедуры

Процедура ПроверитьОрганизацииПродажи(Отказ)
	
	Если СобственныеОрганизацииРазрешенаПродажа.Найти(Справочники.Организации.ПустаяСсылка(), "Организация") <> Неопределено Тогда
		Сообщить("Нельзя указывать в качестве организации продажи пустую организацию!");
		Отказ = Истина;
	КонецЕсли;
	
	Если СобственныеОрганизацииРазрешенаПродажа.Найти(Владелец, "Организация") <> Неопределено Тогда
		Сообщить("Нельзя указывать в качестве организации продажи, организацию-владельца политики!");
		Отказ = Истина;
	КонецЕсли;
	
	 ТЗ = СобственныеОрганизацииРазрешенаПродажа.Выгрузить();
	 ТЗ.Свернуть("Организация", "ПроцентНаценки");
	
	 Если ТЗ.Количество() <>  СобственныеОрганизацииРазрешенаПродажа.Количество() Тогда
		Сообщить("Проверьте дубли строк в организациях продажи");
		Отказ = Истина;
	 КонецЕсли;
	
КонецПроцедуры

Процедура 	ПередЗаписьюПроверитьЗаполненностьРеквизитов(Отказ)

	Если Не ЗначениеЗаполнено(ПериодДействия) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан период действия!", Отказ,, СтатусСообщения.Важное);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не указан собственный контрагент!", Отказ,, СтатусСообщения.Важное);
	КонецЕсли;
	
	Если  РазрешенаПродажаСобственнымОрганизациям И СобственныеОрганизацииРазрешенаПродажа.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Добавьте организации, либо уберите разрешение", Отказ,"Не указано ни одной собственной организации для продажи!", СтатусСообщения.Важное);
	КонецЕсли;
	
КонецПроцедуры
